package by.it.karpovich.jd01_12;

// TaskC1. Нужно ввести с консоли текст до строки end. Во входном тексте хранятся
//наименования некоторых объектов, по одному в строке.
//Строки иногда повторяются.
// Построить ассоциативный массив C, элементы которого содержат наименования
//(значения) и уникальные шифры (ключи) данных объектов, причем элементы
//списка должны быть упорядочены по возрастанию шифров (шифр – некоторое
//случайное, но гарантированно уникальное число).
// Выведите полученный ассоциативный массив в консоль методом toString()
// Затем нужно «сжать» список C, удаляя дублирующийся наименования объектов
//(оставляйте первое вхождение наименования, остальные – удаляются).
// Выведите полученный ассоциативный массив в консоль методом toString()

public class TaskC1 {

}
